ghi-electronics/TinyCLR-Ports/Targets/LPC177x_LPC178x/LPC17_SD.cpp
#define MCIMask0 (*(volatile unsigned long *)0x400C003C)
#define MCIMask0_OFFSET 0x3C

#define MCIMask1 (*(volatile unsigned long *)0x400C0040)
#define MCIMask1_OFFSET 0x40

#define MCIFifoCnt (*(volatile unsigned long *)0x400C0048)
#define MCIFifoCnt_OFFSET 0x48
#define MCIFifoCnt_DataCount_MASK 0x7FFF
#define MCIFifoCnt_DataCount_BIT 0

#define MCIFIFO (*(volatile unsigned long *)0x400C0080)
#define MCIFIFO_OFFSET 0x80

// DMA
#define DATA_BLOCK_LEN        9
#define BLOCK_LENGTH        (1 << DATA_BLOCK_LEN)

#define BLOCK_NUM            0x80
#define FIFO_SIZE            16

#define MAX_GPDMA_CHANNELS 8

#define DMA_SRC            (0x20008000 - 512)

#define DMA_DST            DMA_SRC

#define DMA_MCIFIFO        0x400C0080
#define DMA_SIZE        BLOCK_LENGTH

/* DMA mode */
#define M2M                0x00
#define M2P                0x01
#define P2M                0x02
#define P2P                0x03

/* General-purpose DMA Controller */
#define DMA_BASE_ADDR        0x20080000
#define GPDMA_INT_STAT         (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x000))
#define GPDMA_INT_TCSTAT       (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x004))
#define GPDMA_INT_TCCLR        (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x008))
#define GPDMA_INT_ERR_STAT     (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x00C))
#define GPDMA_INT_ERR_CLR      (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x010))
#define GPDMA_RAW_INT_TCSTAT   (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x014))
#define GPDMA_RAW_INT_ERR_STAT (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x018))
#define GPDMA_ENABLED_CHNS     (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x01C))
#define GPDMA_SOFT_BREQ        (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x020))
#define GPDMA_SOFT_SREQ        (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x024))
#define GPDMA_SOFT_LBREQ       (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x028))
#define GPDMA_SOFT_LSREQ       (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x02C))
#define GPDMA_CONFIG           (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x030))
#define GPDMA_SYNC             (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x034))

/* DMA channel 0 registers */
#define GPDMA_CH0_SRC      (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x100))
#define GPDMA_CH0_DEST     (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x104))
#define GPDMA_CH0_LLI      (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x108))
#define GPDMA_CH0_CTRL     (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x10C))
#define GPDMA_CH0_CFG      (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x110))

/* DMA channel 1 registers */
#define GPDMA_CH1_SRC      (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x120))
#define GPDMA_CH1_DEST     (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x124))
#define GPDMA_CH1_LLI      (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x128))
#define GPDMA_CH1_CTRL     (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x12C))
#define GPDMA_CH1_CFG      (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x130))


#define GPDMA_Source_Register_Channel(ChannelNumber)            (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x100 + (ChannelNumber * 0x20)))
#define GPDMA_Destination_Register_Channel(ChannelNumber)        (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x104 + (ChannelNumber * 0x20)))
#define GPDMA_LinkedListItem_Register_Channel(ChannelNumber)    (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x108 + (ChannelNumber * 0x20)))
#define GPDMA_Control_Register_Channel(ChannelNumber)            (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x10C + (ChannelNumber * 0x20)))
#define GPDMA_Config_Register_Channel(ChannelNumber)            (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x110 + (ChannelNumber * 0x20)))

/******************************************************************************
** Function name:        DMAHandler
**
** Descriptions:        DMA interrupt handler for MCI
**
** parameters:            None
** Returned value:        None
**
******************************************************************************/

void DMAHandler(void * p) {
    uint32_t regVal;
    static uint32_t DMATCCount, DMAErrCount;

    regVal = GPDMA_INT_TCSTAT;
    if (regVal) {
        DMATCCount++;
        GPDMA_INT_TCCLR |= regVal;
    }

    regVal = GPDMA_INT_ERR_STAT;
    if (regVal) {
        DMAErrCount++;
        GPDMA_INT_ERR_CLR |= regVal;
    }
}

/******************************************************************************
** Function name:        DMA_Init
**
** Descriptions:        Setup GPDMA clock and install interrupt handler
**
** parameters:            None
** Returned value:        true or false, false if ISR can't be installed.
**
******************************************************************************/
void DMA_Init(void) {
    LPC_SC->PCONP |= (1 << 29);

    GPDMA_INT_TCCLR = 0xFF;
    GPDMA_INT_ERR_CLR = 0xFF;

    GPDMA_CONFIG = 0x01;

    while (!(GPDMA_CONFIG & 0x01));

    LPC17_Interrupt_Activate(DMA_IRQn, (uint32_t*)&DMAHandler, (void*)0);
}

/******************************************************************************
** Function name:        DMA_Move
**
** Descriptions:        Setup GPDMA for MCI DMA transfer
**                        including mode, M2P or M2M, or P2M,
**                        src and dest. address, control reg. etc.
**
** parameters:            Channel number, DMA mode
** Returned value:        true or false
**
******************************************************************************/
uint32_t DMA_Move(uint32_t ChannelNum, uint32_t DMAMode) {

    GPDMA_INT_TCCLR = 0xFF;
    GPDMA_INT_ERR_CLR = 0xFF;

    if (DMAMode == M2M) {
        GPDMA_Source_Register_Channel(ChannelNum) = DMA_SRC;
        GPDMA_Destination_Register_Channel(ChannelNum) = DMA_DST;

        GPDMA_Control_Register_Channel(ChannelNum) = (0x80000000) |
            (0x01 << 27) |
            (0x01 << 26) |
            (0x02 << 21) |
            (0x02 << 18) |
            (0x04 << 15) |
            (0x04 << 12) |
            (DMA_SIZE & 0x0FFF);
    }
    else if (DMAMode == M2P) {
        GPDMA_Source_Register_Channel(ChannelNum) = DMA_SRC;
        GPDMA_Destination_Register_Channel(ChannelNum) = DMA_MCIFIFO;

        GPDMA_Control_Register_Channel(ChannelNum) = (0x80000000) |
            (0x01 << 26) |
            (0x02 << 21) |
            (0x02 << 18) |
            (0x02 << 15) |
            (0x04 << 12) |
            (DMA_SIZE & 0x0FFF);


        GPDMA_Config_Register_Channel(ChannelNum) = (0x01 << 16) |
            (0x05 << 11) |
            (0x01 << 6) |
            (0x00 << 1) |
            (0x01 << 0);
    }
    else if (DMAMode == P2M) {

        GPDMA_Source_Register_Channel(ChannelNum) = DMA_MCIFIFO;
        GPDMA_Destination_Register_Channel(ChannelNum) = DMA_DST;

        GPDMA_Control_Register_Channel(ChannelNum) = (0x80000000) |
            (0x01 << 27) |
            (0x02 << 21) |
            (0x02 << 18) |
            (0x04 << 15) |
            (0x02 << 12) |
            (DMA_SIZE & 0x0FFF);

        GPDMA_Config_Register_Channel(ChannelNum) = (0x01 << 16) |
            (0x06 << 11) |
            (0x00 << 6) |
            (0x01 << 1) |
            (0x01 << 0);
    }
    else {
        return (false);
    }

    GPDMA_CONFIG = 0x01;

    while (!(GPDMA_CONFIG & 0x01));

