ghi-electronics/TinyCLR-Ports/Targets/LPC177x_LPC178x/LPC17_SD.cpp
    return (true);
}

// MCI
#define TIME_OUT 2000
#define READ_TIME_OUT 100
#define WRITE_TIME_OUT 100
#define CheckStatus_TIME_OUT 50
#define OP_COND_COUNT 0x200
#define ACMD_OP_COND_COUNT 0x40
#define Send_Status_COUNT 0x100

#define MCI_FIFO_BASE        MCI_BASE_ADDR + 0x80
#define MCI_FIFO_INDEX        0x04

#define GO_IDLE_STATE        0        /* GO_IDLE_STATE(MMC) or RESET(SD) */
#define SEND_OP_COND        1        /* SEND_OP_COND(MMC) or ACMD41(SD) */
#define ALL_SEND_CID        2        /* ALL SEND_CID */
#define SET_RELATIVE_ADDR    3        /* SET_RELATE_ADDR */
#define SET_ACMD_BUS_WIDTH    6
#define SELECT_CARD            7        /* SELECT/DESELECT_CARD */
#define SEND_IF_COND        8        /* Send Interface Condition */
#define SEND_CSD            9        /* SEND_CSD */
#define STOP_TRANSMISSION    12        /* Stop either READ or WRITE operation */
#define SEND_STATUS            13        /* SEND_STATUS */
#define SET_BLOCK_LEN        16        /* SET_BLOCK_LEN */
#define READ_SINGLE_BLOCK    17        /* READ_SINGLE_BLOCK */
#define WRITE_BLOCK            24        /* WRITE_BLOCK */
#define SEND_APP_OP_COND    41        /* ACMD41 for SD card */
#define APP_CMD                55        /* APP_CMD, the following will a ACMD */

#define OCR_INDEX            0x00FF8000

#define CARD_STATUS_ACMD_ENABLE        1 << 5
#define CARD_STATUS_RDY_DATA        1 << 8
#define CARD_STATUS_CURRENT_STATE    0x0F << 9
#define CARD_STATUS_ERASE_RESET        1 << 13

#define SLOW_RATE            1
#define NORMAL_RATE            2
#define MMC_RATE            3

#define SD_1_BIT             0
#define SD_4_BIT            1

#define CARD_UNKNOWN        0
#define MMC_CARD            1
#define SD_CARD                2

#define MCI_CLK_375KHZ            79
#define MCI_CLK_10MHz_DEFAULT    2

#define DATA_TIMER_VALUE    5000000

#define EXPECT_NO_RESP        0
#define EXPECT_SHORT_RESP    1
#define EXPECT_LONG_RESP    2


#define BUS_WIDTH_1BIT        0
#define BUS_WIDTH_4BITS        10

/* MCI Status register bit information */
#define MCI_CMD_CRC_FAIL    (1 << 0)
#define MCI_DATA_CRC_FAIL    (1 << 1)
#define MCI_CMD_TIMEOUT        (1 << 2)
#define MCI_DATA_TIMEOUT    (1 << 3)
#define MCI_TX_UNDERRUN        (1 << 4)
#define MCI_RX_OVERRUN        (1 << 5)
#define MCI_CMD_RESP_END    (1 << 6)
#define MCI_CMD_SENT        (1 << 7)
#define MCI_DATA_END        (1 << 8)
#define MCI_START_BIT_ERR    (1 << 9)
#define MCI_DATA_BLK_END    (1 << 10)
#define MCI_CMD_ACTIVE        (1 << 11)
#define MCI_TX_ACTIVE        (1 << 12)
#define MCI_RX_ACTIVE        (1 << 13)
#define MCI_TX_HALF_EMPTY    (1 << 14)
#define MCI_RX_HALF_FULL    (1 << 15)
#define MCI_TX_FIFO_FULL    (1 << 16)
#define MCI_RX_FIFO_FULL    (1 << 17)
#define MCI_TX_FIFO_EMPTY    (1 << 18)
#define MCI_RX_FIFO_EMPTY    (1 << 19)
#define MCI_TX_DATA_AVAIL    (1 << 20)
#define MCI_RX_DATA_AVAIL    (1 << 21)

#define CMD_INT_MASK      (MCI_CMD_CRC_FAIL | MCI_CMD_TIMEOUT | MCI_CMD_RESP_END \
                         | MCI_CMD_SENT     | MCI_CMD_ACTIVE)

#define DATA_ERR_INT_MASK    (MCI_DATA_CRC_FAIL | MCI_DATA_TIMEOUT | MCI_TX_UNDERRUN \
                           | MCI_RX_OVERRUN | MCI_START_BIT_ERR)

#define ACTIVE_INT_MASK ( MCI_TX_ACTIVE | MCI_RX_ACTIVE)

#define FIFO_INT_MASK        (MCI_TX_HALF_EMPTY | MCI_RX_HALF_FULL \
                           | MCI_TX_FIFO_FULL  | MCI_RX_FIFO_FULL \
                           | MCI_TX_FIFO_EMPTY | MCI_RX_FIFO_EMPTY \
                           | MCI_DATA_BLK_END )

#define    FIFO_TX_INT_MASK (MCI_TX_HALF_EMPTY )
#define    FIFO_RX_INT_MASK (MCI_RX_HALF_FULL  )

#define DATA_END_INT_MASK    (MCI_DATA_END | MCI_DATA_BLK_END)

#define ERR_TX_INT_MASK (MCI_DATA_CRC_FAIL | MCI_DATA_TIMEOUT | MCI_TX_UNDERRUN | MCI_START_BIT_ERR)
#define ERR_RX_INT_MASK (MCI_DATA_CRC_FAIL | MCI_DATA_TIMEOUT | MCI_RX_OVERRUN  | MCI_START_BIT_ERR)

/* Error code on the command response. */
#define INVALID_RESPONSE    0xFFFFFFFF

extern void MCI_TXEnable(void);
extern void MCI_TXDisable(void);
extern void MCI_RXEnable(void);
extern void MCI_RXDisable(void);

extern void MCI_Init(void);
extern void  MCI_SendCmd(uint32_t CmdIndex, uint32_t Argument, uint32_t ExpectResp, uint32_t AllowTimeout);
extern uint32_t MCI_GetCmdResp(uint32_t CmdIndex, uint32_t NeedRespFlag, uint32_t *CmdRespStatus);

extern void  MCI_Set_MCIClock(uint32_t clockrate);
extern bool SD_Set_BusWidth(uint32_t width);

extern uint32_t MCI_CardInit(void);
extern bool MCI_Go_Idle_State(void);
extern bool MCI_Check_CID(void);
extern bool MCI_Set_Address(void);
extern bool MCI_Send_CSD(void);
extern bool MCI_Select_Card(void);
extern uint32_t MCI_Send_Status(void);
extern bool MCI_Set_BlockLen(uint32_t blockLength);
extern bool MCI_Send_ACMD_Bus_Width(uint32_t buswidth);
extern bool MCI_Send_Stop(void);

typedef void(*MCI_DATA_END_CALLBACK)();

extern bool MCI_Write_Block(uint32_t blockNum, MCI_DATA_END_CALLBACK MCI_DATA_END_Callback);
extern bool MCI_Read_Block(uint32_t blockNum, MCI_DATA_END_CALLBACK MCI_DATA_END_Callback);

bool MCI_And_Card_initialize();

bool MCI_ReadSector(uint32_t sector, uint8_t *readbuffer);
bool MCI_WriteSector(uint32_t sector, uint8_t *writebuffer);

uint64_t sdMediaSize = 0;
uint32_t sdSectorsPerBlock = 0;
bool isSDHC;


typedef enum mci_func_error {
    MCI_FUNC_OK = 0,
    MCI_FUNC_FAILED = -1,
    MCI_FUNC_BAD_PARAMETERS = -2,
    MCI_FUNC_BUS_NOT_IDLE = -3,
    MCI_FUNC_TIMEOUT = -3,
    MCI_FUNC_ERR_STATE = -4,
    MCI_FUNC_NOT_READY = -5,
}en_Mci_Func_Error;

/* MultiMedia Card Interface(MCI) Controller */
#define MCI_BASE_ADDR        0x400C0000 // 0xE008C000
#define MCI_POWER      (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x00))
#define MCI_CLOCK      (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x04))
#define MCI_ARGUMENT   (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x08))
#define MCI_COMMAND    (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x0C))
#define MCI_RESP_CMD   (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x10))
#define MCI_RESP0      (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x14))
#define MCI_RESP1      (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x18))
#define MCI_RESP2      (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x1C))
#define MCI_RESP3      (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x20))
#define MCI_DATA_TMR   (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x24))
#define MCI_DATA_LEN   (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x28))
#define MCI_DATA_CTRL  (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x2C))
#define MCI_DATA_CNT   (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x30))
#define MCI_STATUS     (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x34))
#define MCI_CLEAR      (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x38))
#define MCI_MASK0      (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x3C))
#define MCI_FIFO_CNT   (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x48))
#define MCI_FIFO       (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x80))

volatile uint32_t MCI_DataErrorProcess_count = 0;
volatile uint32_t MCI_DATA_END_InterruptService_count = 0;
volatile uint32_t MCI_FIFOInterruptService_count = 0;
volatile uint32_t MCI_CmdProcess_count = 0;

