ghi-electronics/TinyCLR-Ports/Targets/LPC177x_LPC178x/LPC17_SD.cpp
volatile uint32_t CmdCRCErrCount = 0;
volatile uint32_t CmdTimeoutErrCount = 0;
volatile uint32_t CmdRespEndCount = 0;
volatile uint32_t CmdSentCount = 0;
volatile uint32_t CmdActiveCount = 0;

volatile uint32_t DataCRCErrCount = 0;
volatile uint32_t DataTimeoutErrCount = 0;
volatile uint32_t DataTxUnderrunErrCount = 0;
volatile uint32_t DataRxOverrunErrCount = 0;
volatile uint32_t DataStartbitErrCount = 0;

volatile uint32_t DataEndCount = 0;
volatile uint32_t DataBlockEndCount = 0;
volatile uint32_t MCI_Block_End_Flag = 0;

volatile uint32_t DataTxActiveCount = 0;
volatile uint32_t DataRxActiveCount = 0;

volatile uint32_t DataFIFOCount = 0;
volatile uint32_t DataRxFIFOCount = 0;
volatile uint32_t DataTxFIFOCount = 0;

volatile uint32_t CardRCA;
volatile uint32_t MCI_CardType;

uint32_t MCI_ReadFifo(volatile uint32_t * dest) {
    int i;

    for (i = 0; i < 8; i++)
        dest[i] = MCIFIFO;

    return 0;
}

uint32_t MCI_WriteFifo(volatile uint32_t * src) {
    int i;

    for (i = 0; i < 8; i++)
        MCIFIFO = src[i];

    return 0;
}


uint8_t *WriteBlock = (uint8_t *)(DMA_SRC);
uint8_t *ReadBlock = (uint8_t *)(DMA_DST);

volatile uint32_t TXBlockCounter = 0, RXBlockCounter = 0;
/******************************************************************************
** Function name:        MCI_Interrupt related
**
** Descriptions:        MCI interrupt handler and related APIs
**
**
** parameters:            None
** Returned value:        None
**
******************************************************************************/
void MCI_TXEnable(void) {
    MCI_MASK0 |= ((DATA_END_INT_MASK) | (ERR_TX_INT_MASK));
}
/*****************************************************************/

void MCI_TXDisable(void) {
    MCI_MASK0 &= ~((DATA_END_INT_MASK) | (ERR_TX_INT_MASK));
}

/*****************************************************************/
void MCI_RXEnable(void) {
    MCI_MASK0 |= ((DATA_END_INT_MASK) | (ERR_RX_INT_MASK));
}

/*****************************************************************/

void MCI_RXDisable(void) {
    MCI_MASK0 &= ~((DATA_END_INT_MASK) | (ERR_RX_INT_MASK));
}

/******************************************************************************
** Function name:        MCI_CheckStatus
**
** Descriptions:        MCI Check status before and after the block read and
**                        write. Right after the block read and write, this routine
**                        is important that, even the FIFO is empty, complete
**                        block has been sent, but, data is still being written
**                        to the card, this routine is to ensure that the data
**                        has been written based on the state of the card, not
**                        by the length being set.
**
** parameters:            None
** Returned value:        true or false
**
******************************************************************************/
bool MCI_CheckStatus(void) {
    uint32_t respValue;
    uint32_t i;
    i = 0;
    while (i < CheckStatus_TIME_OUT) {
        if ((respValue = MCI_Send_Status()) == INVALID_RESPONSE) {
            break;
        }
        else {

            if ((respValue & (0x0F << 8)) == 0x0900) {
                return (true);
            }
        }

        i++;

        LPC17_Time_Delay(nullptr, 1000);
    }
    return (false);
}

/******************************************************************************
** Function name:        MCI_CmdProcess
**
** Descriptions:        Called by MCI interrupt handler
**                        To simplify the process, for card initialization, the
**                        CMD interrupts are disabled.
**
**
** parameters:            None
** Returned value:        None
**
******************************************************************************/
void MCI_CmdProcess(void) {
    uint32_t MCIStatus;

    MCIStatus = MCI_STATUS;
    if (MCIStatus &  MCI_CMD_CRC_FAIL) {
        CmdCRCErrCount++;
        MCI_CLEAR = MCI_CMD_CRC_FAIL;
    }
    if (MCIStatus &  MCI_CMD_TIMEOUT) {
        CmdTimeoutErrCount++;
        MCI_CLEAR = MCI_CMD_TIMEOUT;
    }
    /* Cmd Resp End or Cmd Sent */
    if (MCIStatus &  MCI_CMD_RESP_END) {
        CmdRespEndCount++;
        MCI_CLEAR = MCI_CMD_RESP_END;
    }
    if (MCIStatus &  MCI_CMD_SENT) {
        CmdSentCount++;
        MCI_CLEAR = MCI_CMD_SENT;
    }
    if (MCIStatus &  MCI_CMD_ACTIVE) {
        CmdActiveCount++;
        MCI_CLEAR = MCI_CMD_ACTIVE;
    }
    return;
}

/******************************************************************************
** Function name:        MCI_DataErrorProcess
**
** Descriptions:        Called by MCI interrupt handler
**                        Process data error.
**
** parameters:            None
** Returned value:        None
**
******************************************************************************/
void MCI_DataErrorProcess(void) {
    uint32_t MCIStatus;

    MCIStatus = MCI_STATUS;
    if (MCIStatus &  MCI_DATA_CRC_FAIL) {
        DataCRCErrCount++;
        MCI_CLEAR = MCI_DATA_CRC_FAIL;
    }
    if (MCIStatus &  MCI_DATA_TIMEOUT) {
        DataTimeoutErrCount++;
        MCI_CLEAR = MCI_DATA_TIMEOUT;
    }
    /* Underrun or overrun */
    if (MCIStatus &  MCI_TX_UNDERRUN) {
        DataTxUnderrunErrCount++;
        MCI_CLEAR = MCI_TX_UNDERRUN;
    }
    if (MCIStatus &  MCI_RX_OVERRUN) {
        DataRxOverrunErrCount++;
        MCI_CLEAR = MCI_RX_OVERRUN;
    }
    /* Start bit error on data signal */
    if (MCIStatus &  MCI_START_BIT_ERR) {
        DataStartbitErrCount++;
        MCI_CLEAR = MCI_START_BIT_ERR;
    }
    return;
}

/******************************************************************************
** Function name:        MCI_DATA_END_InterruptService
**
** Descriptions:        Called by MCI interrupt handler
**                        This is the last interrupt module processing
**                      the block write and    read to and from the MM card.
**
**                      FIFO interrupts are also used when DMA is disabled
**                        This routine simply clears the
**                      MCI_Block_End_Flag, and increments counters for debug
**
** parameters:            None
** Returned value:        None
**
******************************************************************************/
MCI_DATA_END_CALLBACK MCI_DATA_END_Callback;
MCI_DATA_END_CALLBACK MCI_DATA_END_Callback_temp;
void MCI_DATA_END_InterruptService(void) {
    uint32_t MCIStatus;

    MCIStatus = MCI_STATUS;
    if (MCIStatus &  MCI_DATA_END)        /* Data end, and Data block end  */
    {
        DataEndCount++;
        MCI_CLEAR = MCI_DATA_END;
        return;
    }
    if (MCIStatus &  MCI_DATA_BLK_END) {
        DataBlockEndCount++;
        MCI_CLEAR = MCI_DATA_BLK_END;
        MCI_TXDisable();
        if (MCI_DATA_END_Callback) {
            MCI_DATA_END_Callback_temp = MCI_DATA_END_Callback;
            MCI_DATA_END_Callback = NULL;
            MCI_DATA_END_Callback_temp();

