ghi-electronics/TinyCLR-Ports/Targets/LPC177x_LPC178x/LPC17_SD.cpp
/******************************************************************************
** Function name:        MCI_GetCmdResp
**
** Descriptions:        Get response from the card. This module is always used
**                        in pair with MCI_SendCmd()
**
** parameters:            Expected cmd data, expect response flag, pointer to the
**                        response
**                        Expected cmd data should be the same as that in SendCmd()
**                        expect response flag could be    EXPECT_NO_RESP
**                                                        EXPECT_SHORT_RESP
**                                                        EXPECT_LONG_RESP
**                        if GetCmdResp() is 0, check the pointer to the response
**                        field to get the response value, if GetCmdResp() returns
**                        non-zero, no need to check the response field, just resend
**                        command or bailout.
** Returned value:        Response status, 0 is valid response.
**
******************************************************************************/
uint32_t MCI_GetCmdResp(uint32_t ExpectCmdData, uint32_t ExpectResp, uint32_t *CmdResp) {
    uint32_t CmdRespStatus = 0;
    uint32_t LastCmdIndex;
    uint32_t i;

    int32_t retry = 0xFFFF;

    if (ExpectResp == EXPECT_NO_RESP) {
        return (0);
    }

    bool stop = false;

    while (!stop) {
        CmdRespStatus = MCI_STATUS;
        if (CmdRespStatus & (MCI_CMD_TIMEOUT)) {
            MCI_CLEAR = CmdRespStatus | MCI_CMD_TIMEOUT;
            MCI_COMMAND = 0;
            MCI_ARGUMENT = 0xFFFFFFFF;
            return (CmdRespStatus);
        }
        if (CmdRespStatus & MCI_CMD_CRC_FAIL) {
            MCI_CLEAR = CmdRespStatus | MCI_CMD_CRC_FAIL;

            while (retry-- > 0) {
                LPC17_Time_Delay(nullptr, 1); // delay 1us

                LastCmdIndex = MCI_COMMAND & 0x003F;

                if ((LastCmdIndex == SEND_OP_COND) || (LastCmdIndex == SEND_APP_OP_COND) || (LastCmdIndex == STOP_TRANSMISSION)) {

                    MCI_COMMAND = 0;
                    MCI_ARGUMENT = 0xFFFFFFFF;

                    stop = true;
                    break;
                }
            }

            if (retry == 0)
                return (CmdRespStatus);
        }
        else if (CmdRespStatus & MCI_CMD_RESP_END) {
            MCI_CLEAR = CmdRespStatus | MCI_CMD_RESP_END;
            break;
        }
    }

    if ((MCI_RESP_CMD & 0x3F) != ExpectCmdData) {
        if ((ExpectCmdData != SEND_OP_COND) && (ExpectCmdData != SEND_APP_OP_COND)
            && (ExpectCmdData != ALL_SEND_CID) && (ExpectCmdData != SEND_CSD)) {
            CmdRespStatus = INVALID_RESPONSE;
            return (INVALID_RESPONSE);
        }
    }

    if (ExpectResp == EXPECT_SHORT_RESP) {
        *CmdResp = MCI_RESP0;
        *(CmdResp + 1) = 0;
        *(CmdResp + 2) = 0;
        *(CmdResp + 3) = 0;
    }
    else if (ExpectResp == EXPECT_LONG_RESP) {
        *CmdResp = MCI_RESP0;
        *(CmdResp + 1) = MCI_RESP1;
        *(CmdResp + 2) = MCI_RESP2;
        *(CmdResp + 3) = MCI_RESP3;
    }
    return (0);
}

/******************************************************************************
** Function name:        MCI_Go_Idle_State
**
** Descriptions:        CMD0, the very first command to be sent to initialize
**                        either MMC or SD card.
**
** parameters:            None
** Returned value:        true or false, true if card has been initialized.
**
******************************************************************************/
bool MCI_Go_Idle_State(void) {
    uint32_t retryCount;
    uint32_t respStatus;
    uint32_t respValue[4];

    retryCount = 0x20;

    while (retryCount > 0) {
        MCI_SendCmd(GO_IDLE_STATE, 0x00000000, EXPECT_NO_RESP, 0);
        respStatus = MCI_GetCmdResp(GO_IDLE_STATE, EXPECT_NO_RESP, (uint32_t *)respValue);
        if (respStatus == 0) {
            break;
        }
        retryCount--;
    }

    if (respStatus != 0)        /* timeout, give up */
    {
        return (false);
    }

    return(true);
}

/******************************************************************************
** Function name:        MCI_Send_ACMD
**
** Descriptions:        CMD55, before sending an ACMD, call this routine first
**
** parameters:            None
** Returned value:        true or false, true if card has responded before timeout.
**                        false is timeout.
**
******************************************************************************/
uint32_t MCI_Send_ACMD(void) {
    uint32_t i, retryCount;
    uint32_t CmdArgument;
    uint32_t respStatus;
    uint32_t respValue[4];

    if (MCI_CardType == SD_CARD) {
        CmdArgument = CardRCA;
    }
    else {
        CmdArgument = 0x00000000;
    }

    retryCount = 20;

    while (retryCount > 0) {
        /* Send CMD55 command followed by an ACMD */
        MCI_SendCmd(APP_CMD, CmdArgument, EXPECT_SHORT_RESP, 0);
        respStatus = MCI_GetCmdResp(APP_CMD, EXPECT_SHORT_RESP, (uint32_t *)&respValue[0]);
        if (!respStatus && (respValue[0] & CARD_STATUS_ACMD_ENABLE)) {
            return(true);
        }

        LPC17_Time_Delay(nullptr, 1000); // delay 1ms

        retryCount--;
    }

    return(false);
}

/******************************************************************************
** Function name:        MCI_Send_OP_Cond
**
** Descriptions:        CMD1 for MMC
**
** parameters:            None
** Returned value:        true or false, true if card has response back before
**                        timeout, false is timeout on the command.
**
******************************************************************************/
uint32_t MCI_Send_OP_Cond(void) {
    uint32_t i, retryCount;
    uint32_t respStatus;
    uint32_t respValue[4];

    retryCount = OP_COND_COUNT;

    while (retryCount > 0) {
        /* Send CMD1 command repeatedly until the response is back correctly */
        MCI_SendCmd(SEND_OP_COND, OCR_INDEX, EXPECT_SHORT_RESP, 0/*0*/);
        respStatus = MCI_GetCmdResp(SEND_OP_COND, EXPECT_SHORT_RESP, (uint32_t *)&respValue[0]);
        /* bit 0 and bit 2 must be zero, or it's timeout or CRC error */
        if (!(respStatus & MCI_CMD_TIMEOUT) && (respValue[0] & 0x80000000)) {
            return (true);    /* response is back and correct. */
        }

        LPC17_Time_Delay(nullptr, 1000); // delay 1ms

