ghi-electronics/TinyCLR-Ports/Targets/LPC177x_LPC178x/LPC17_SD.cpp
/******************************************************************************
** Function name:        MCI_Send_CSD
**
** Descriptions:        CMD9, SEND_CSD cmd, it should be sent only at
**                        STBY state and after CMD3. See MMC and SD spec. state
**                        diagram.
**
** parameters:            None
** Returned value:        Response value
**
******************************************************************************/
bool MCI_Send_CSD(void) {
    uint32_t i, retryCount, temp;
    uint32_t respStatus;
    uint32_t respValue[4];
    uint32_t CmdArgument;
    unsigned char *regCSD = (unsigned char *)respValue;

    if (MCI_CardType == SD_CARD) {
        CmdArgument = CardRCA;
    }
    else {
        CmdArgument = 0x00010000;
    }

    retryCount = 0x20;
    while (retryCount > 0) {
        /* Send SET_BLOCK_LEN command before read and write */
        MCI_CLEAR |= (MCI_CMD_TIMEOUT | MCI_CMD_CRC_FAIL | MCI_CMD_RESP_END);
        MCI_SendCmd(SEND_CSD, CmdArgument, EXPECT_LONG_RESP, 0);
        respStatus = MCI_GetCmdResp(SEND_CSD, EXPECT_LONG_RESP, (uint32_t *)&respValue[0]);
        if (!respStatus) {

            for (i = 0; i <= 12; i += 4) {
                temp = regCSD[i + 0];
                regCSD[i + 0] = regCSD[i + 3];
                regCSD[i + 3] = temp;

                temp = regCSD[i + 1];
                regCSD[i + 1] = regCSD[i + 2];
                regCSD[i + 2] = temp;
            }

            uint8_t SECTOR_SIZE, READ_BL_LEN;
            uint8_t C_SIZE_MULT = 0;
            bool ERASE_BL_EN;
            uint32_t C_SIZE;
            uint64_t MemCapacity = 0;

            READ_BL_LEN = regCSD[5] & 0x0F;

            if (regCSD[0] == 0x00) {
                C_SIZE = ((regCSD[6] & 0x3) << 10) | (regCSD[7] << 2) | ((regCSD[8] & 0xC0) >> 6);

                C_SIZE_MULT = ((regCSD[9] & 0x03) << 1) | ((regCSD[10] & 0x80) >> 7);

                ERASE_BL_EN = ((regCSD[10] & 0x40) == 0x00) ? false : true;

                SECTOR_SIZE = ((regCSD[10] & 0x3F) << 1) | ((regCSD[11] & 0x80) >> 7);

                MemCapacity = (uint64_t)(C_SIZE + 1)*(0x1 << (C_SIZE_MULT + 2))*(0x1 << READ_BL_LEN);
            }
            else {
                C_SIZE = ((regCSD[7] & 0x3F) << 16) | (regCSD[8] << 8) | regCSD[9];

                ERASE_BL_EN = ((regCSD[10] & 0x40) == 0x00) ? false : true;

                SECTOR_SIZE = ((regCSD[10] & 0x3F) << 1) | ((regCSD[11] & 0x80) >> 7);

                MemCapacity = (uint64_t)(C_SIZE + 1) * 512 * 1024;
            }

            sdSectorsPerBlock = (ERASE_BL_EN == true) ? 1 : (SECTOR_SIZE + 1);
            sdMediaSize = MemCapacity;

            return (true);
        }

        LPC17_Time_Delay(nullptr, 1000);

        retryCount--;
    }

    return (false);
}

/******************************************************************************
** Function name:        MCI_Select_Card
**
** Descriptions:        CMD7, SELECT_CARD, should be after CMD9, the state
**                        will be inter-changed between STBY and TRANS after
**                        this cmd.
**
** parameters:            None
** Returned value:        return false if response times out.
**
******************************************************************************/
bool MCI_Select_Card(void) {
    uint32_t i, retryCount;
    uint32_t respStatus;
    uint32_t respValue[4];
    uint32_t CmdArgument;

    if (MCI_CardType == SD_CARD) {
        CmdArgument = CardRCA;
    }
    else {
        CmdArgument = 0x00010000;
    }

    retryCount = 0x20;
    while (retryCount > 0) {
        /* Send SELECT_CARD command before read and write */
        MCI_CLEAR |= (MCI_CMD_TIMEOUT | MCI_CMD_CRC_FAIL | MCI_CMD_RESP_END);
        MCI_SendCmd(SELECT_CARD, CmdArgument, EXPECT_SHORT_RESP, 0);
        respStatus = MCI_GetCmdResp(SELECT_CARD, EXPECT_SHORT_RESP, (uint32_t *)&respValue[0]);
        if (!respStatus && ((respValue[0] & (0x0F << 8)) == 0x0700)) {
            return (true);
        }

        LPC17_Time_Delay(nullptr, 1000); // delay 1ms

        retryCount--;
    }
    return (false);
}

/******************************************************************************
** Function name:        MCI_Send_Status
**
** Descriptions:        CMD13, SEND_STATUS, the most important cmd to
**                        debug the state machine of the card.
**
** parameters:            None
** Returned value:        Response value(card status), true if the ready bit
**                        is set in the card status register, if timeout, return
**                        INVALID_RESPONSE 0xFFFFFFFF.
**
******************************************************************************/
uint32_t MCI_Send_Status(void) {
    uint32_t retryCount;
    uint32_t respStatus;
    uint32_t respValue[4];
    uint32_t CmdArgument;

    if (MCI_CardType == SD_CARD) {
        CmdArgument = CardRCA;
    }
    else {
        CmdArgument = 0x00010000;
    }

    retryCount = Send_Status_COUNT;
    while (retryCount > 0) {
        /* Send SELECT_CARD command before read and write */
        MCI_CLEAR |= (MCI_CMD_TIMEOUT | MCI_CMD_CRC_FAIL | MCI_CMD_RESP_END);
        MCI_SendCmd(SEND_STATUS, CmdArgument, EXPECT_SHORT_RESP, 0);
        respStatus = MCI_GetCmdResp(SEND_STATUS, EXPECT_SHORT_RESP, (uint32_t *)&respValue[0]);
        if (!respStatus && (respValue[0] & (1 << 8))) {
            return (respValue[0]);
        }
        retryCount--;

        LPC17_Time_Delay(nullptr, 1000); // delay 1ms
    }
    return (INVALID_RESPONSE);
}

/******************************************************************************
** Function name:        MCI_Set_BlockLen
**
** Descriptions:        CMD16, SET_BLOCKLEN, called after CMD7(SELECT_CARD)
**                        called in the TRANS state.
**
** parameters:            The length of the data block to be written or read.
** Returned value:        true or false, return true if ready bit is set, and it's
**                        in TRANS state.
**
******************************************************************************/
bool MCI_Set_BlockLen(uint32_t blockLength) {
    uint32_t i, retryCount;
    uint32_t respStatus;
    uint32_t respValue[4];

    retryCount = 0x20;

