ghi-electronics/TinyCLR-Ports/Targets/LPC177x_LPC178x/LPC17_SD.cpp
    while (retryCount > 0) {
        /* Send SET_BLOCK_LEN command before read and write */
        MCI_CLEAR |= (MCI_CMD_TIMEOUT | MCI_CMD_CRC_FAIL | MCI_CMD_RESP_END);
        MCI_SendCmd(SET_BLOCK_LEN, blockLength, EXPECT_SHORT_RESP, 0);
        respStatus = MCI_GetCmdResp(SET_BLOCK_LEN, EXPECT_SHORT_RESP, (uint32_t *)&respValue[0]);

        /* bit 9 through 12 should be in transfer state now. bit 8 is ready. */
        if (!respStatus && ((respValue[0] & (0x0F << 8)) == 0x0900)) {
            return (true);
        }

        LPC17_Time_Delay(nullptr, 1000); // delay 1ms

        retryCount--;
    }
    return (false);
}

/******************************************************************************
** Function name:        MCI_Send_ACMD_Bus_Width
**
** Descriptions:        ACMD6, SET_BUS_WIDTH, if it's SD card, we can
**                        use the 4-bit bus instead of 1-bit. This cmd
**                        can only be called during TRANS state.
**                        Since it's a ACMD, CMD55 APP_CMD needs to be
**                        sent out first.
**
** parameters:            Bus width value, 1-bit is 0, 4-bit is 10
** Returned value:        true or false, true if the card is still in the
**                        TRANS state after the cmd.
**
******************************************************************************/
bool MCI_Send_ACMD_Bus_Width(uint32_t buswidth) {
    uint32_t i, retryCount;
    uint32_t respStatus;
    uint32_t respValue[4];

    retryCount = 0x20;
    while (retryCount > 0) {
        if (MCI_Send_ACMD() == false) {
            continue;
        }
        /* Send ACMD6 command to set the bus width */
        MCI_SendCmd(SET_ACMD_BUS_WIDTH, buswidth, EXPECT_SHORT_RESP, 0);
        respStatus = MCI_GetCmdResp(SET_ACMD_BUS_WIDTH, EXPECT_SHORT_RESP, (uint32_t *)&respValue[0]);
        if (!respStatus && ((respValue[0] & (0x0F << 8)) == 0x0900)) {
            return (true);
        }

        LPC17_Time_Delay(nullptr, 1000);

        retryCount--;
    }
    return(false);
}

/******************************************************************************
** Function name:        MCI_Send_Stop
**
** Descriptions:        CMD12, STOP_TRANSMISSION. if that happens, the card is
**                        maybe in a unknown state that need a warm reset.
**
** parameters:            None
** Returned value:        true or false, true if, at least, the card status
**                        shows ready bit is set.
**
******************************************************************************/
bool MCI_Send_Stop(void) {
    uint32_t i, retryCount;
    uint32_t respStatus;
    uint32_t respValue[4];

    retryCount = 0x20;
    while (retryCount > 0) {
        MCI_CLEAR = 0x7FF;
        MCI_SendCmd(STOP_TRANSMISSION, 0x00000000, EXPECT_SHORT_RESP, 0);
        respStatus = MCI_GetCmdResp(STOP_TRANSMISSION, EXPECT_SHORT_RESP, (uint32_t *)respValue);
        /* ready bit, bit 8, should be set in the card status register */
        if (!respStatus && (respValue[0] & (1 << 8))) {
            return(true);
        }

        LPC17_Time_Delay(nullptr, 1000);

        retryCount--;
    }
    return (false);
}

/******************************************************************************
** Function name:        MCI_Send_Write_Block
**
** Descriptions:        CMD24, WRITE_BLOCK, send this cmd in the TRANS state
**                        to write a block of data to the card.
**
** parameters:            block number
** Returned value:        Response value
**
******************************************************************************/
uint32_t MCI_Send_Write_Block(uint32_t blockNum) {
    uint32_t i, retryCount;
    uint32_t respStatus;
    uint32_t respValue[4];

    if (!isSDHC)
        blockNum *= BLOCK_LENGTH;

    retryCount = 0x20;
    while (retryCount > 0) {
        MCI_CLEAR = 0x7FF;
        MCI_SendCmd(WRITE_BLOCK, blockNum, EXPECT_SHORT_RESP, 0);
        respStatus = MCI_GetCmdResp(WRITE_BLOCK, EXPECT_SHORT_RESP, (uint32_t *)&respValue[0]);
        /* it should be in the transfer state, bit 9~12 is 0x0100 and bit 8 is 1 */
        if (!respStatus && ((respValue[0] & (0x0F << 8)) == 0x0900)) {
            return(true);
        }

        LPC17_Time_Delay(nullptr, 1000);

        retryCount--;
    }
    return (false);
}

/******************************************************************************
** Function name:        MCI_Send_Read_Block
**
** Descriptions:        CMD17, READ_SINGLE_BLOCK, send this cmd in the TRANS
**                        state to read a block of data from the card.
**
** parameters:            block number
** Returned value:        Response value
**
******************************************************************************/
uint32_t MCI_Send_Read_Block(uint32_t blockNum) {
    uint32_t i, retryCount;
    uint32_t respStatus;
    uint32_t respValue[4];

    if (!isSDHC)
        blockNum *= BLOCK_LENGTH;

    retryCount = 0x20;

    while (retryCount > 0) {
        MCI_CLEAR = 0x7FF;
        MCI_SendCmd(READ_SINGLE_BLOCK, blockNum, EXPECT_SHORT_RESP, 0);
        respStatus = MCI_GetCmdResp(READ_SINGLE_BLOCK, EXPECT_SHORT_RESP, (uint32_t *)&respValue[0]);
        /* it should be in the transfer state, bit 9~12 is 0x0100 and bit 8 is 1 */
        if (!respStatus && ((respValue[0] & (0x0F << 8)) == 0x0900)) {
            return(true);
        }

        LPC17_Time_Delay(nullptr, 1000);
        retryCount--;
    }
    return (false);
}

/******************************************************************************
** Function name:        MCI_Write_Block
**
** Descriptions:        Set MCI data control register, data length and data
**                        timeout, send WRITE_BLOCK cmd, finally, enable
**                        interrupt. On completion of WRITE_BLOCK cmd, TX_ACTIVE
**                        interrupt will occurs, data can be written continuously
**                        into the FIFO until the block data length is reached.
**
** parameters:            block number
** Returned value:        true or false, if cmd times out, return false and no
**                        need to continue.
**
******************************************************************************/

bool MCI_Write_Block(uint32_t blockNum, MCI_DATA_END_CALLBACK Write_end_Callback) {
    uint32_t i;
    uint32_t DataCtrl = 0;

