ghi-electronics/TinyCLR-Ports/Targets/LPC177x_LPC178x/LPC17_SD.cpp
    while (retryCount > 0) {

        MCI_SendCmd(SEND_IF_COND, CmdArgument, EXPECT_SHORT_RESP, 1/*Allow a command timeout*/);
        respStatus = MCI_GetCmdResp(SEND_IF_COND, EXPECT_SHORT_RESP, (uint32_t *)&respValue[0]);

        if (respStatus & MCI_CMD_TIMEOUT) {
            //Consider as no response
            retval = MCI_FUNC_TIMEOUT;
        }
        else if ((respValue[0] & 0xFF /*Checkerpattern Bit Mask*/) != checkPattern) {
            retval = MCI_FUNC_FAILED;
        }
        else if (((respValue[0] >> 8 /* Voltage Supplied Bit*/) & 0xFF/* Voltage Supplied Bit Mask*/)
            != voltageSupplied) {
            retval = MCI_FUNC_BAD_PARAMETERS;
        }
        else {
            retval = MCI_FUNC_OK;
            break;
        }

        LPC17_Time_Delay(nullptr, 1000); // delay 1ms

        retryCount--;
    }

    return retval;
}

// lpc17
#define LPC17_SD_SECTOR_SIZE 512
#define LPC17_SD_TIMEOUT 5000000
#define TOTAL_SDCARD_CONTROLLERS 1

static TinyCLR_Storage_Controller sdCardControllers[TOTAL_SDCARD_CONTROLLERS];
static TinyCLR_Api_Info sdCardApi[TOTAL_SDCARD_CONTROLLERS];

struct SdCardState {
    int32_t controllerIndex;

    uint64_t *regionAddresses;
    size_t  *regionSizes;

    TinyCLR_Storage_Descriptor descriptor;

    bool isOpened = false;
};

static const LPC17_Gpio_Pin sdCardData0Pins[] = LPC17_SD_DATA0_PINS;
static const LPC17_Gpio_Pin sdCardData1Pins[] = LPC17_SD_DATA1_PINS;
static const LPC17_Gpio_Pin sdCardData2Pins[] = LPC17_SD_DATA2_PINS;
static const LPC17_Gpio_Pin sdCardData3Pins[] = LPC17_SD_DATA3_PINS;
static const LPC17_Gpio_Pin sdCardClkPins[] = LPC17_SD_CLK_PINS;
static const LPC17_Gpio_Pin sdCardCmdPins[] = LPC17_SD_CMD_PINS;

static SdCardState sdCardStates[TOTAL_SDCARD_CONTROLLERS];

const TinyCLR_Api_Info* LPC17_SdCard_GetApi() {
    for (auto i = 0; i < TOTAL_SDCARD_CONTROLLERS; i++) {
        sdCardControllers[i].ApiInfo = &sdCardApi[i];
        sdCardControllers[i].Acquire = &LPC17_SdCard_Acquire;
        sdCardControllers[i].Release = &LPC17_SdCard_Release;
        sdCardControllers[i].Open = &LPC17_SdCard_Open;
        sdCardControllers[i].Close = &LPC17_SdCard_Close;
        sdCardControllers[i].Write = &LPC17_SdCard_Write;
        sdCardControllers[i].Read = &LPC17_SdCard_Read;
        sdCardControllers[i].Erase = &LPC17_SdCard_Erases;
        sdCardControllers[i].IsErased = &LPC17_SdCard_IsErased;
        sdCardControllers[i].GetDescriptor = &LPC17_SdCard_GetDescriptor;
        sdCardControllers[i].IsPresent = &LPC17_SdCard_IsPresent;
        sdCardControllers[i].SetPresenceChangedHandler = &LPC17_SdCard_SetPresenceChangedHandler;

        sdCardApi[i].Author = "GHI Electronics, LLC";
        sdCardApi[i].Name = "GHIElectronics.TinyCLR.NativeApis.LPC17.SdCardStorageController";
        sdCardApi[i].Type = TinyCLR_Api_Type::StorageController;
        sdCardApi[i].Version = 0;
        sdCardApi[i].Implementation = &sdCardControllers[i];
        sdCardApi[i].State = &sdCardStates[i];

        sdCardStates[i].controllerIndex = i;
    }

    return (const TinyCLR_Api_Info*)&sdCardApi;
}

TinyCLR_Result LPC17_SdCard_Acquire(const TinyCLR_Storage_Controller* self) {
    auto state = reinterpret_cast<SdCardState*>(self->ApiInfo->State);

    if (state->isOpened) return TinyCLR_Result::SharingViolation;

    auto controllerIndex = state->controllerIndex;

    auto d0 = sdCardData0Pins[controllerIndex];
    auto d1 = sdCardData1Pins[controllerIndex];
    auto d2 = sdCardData2Pins[controllerIndex];
    auto d3 = sdCardData3Pins[controllerIndex];
    auto clk = sdCardClkPins[controllerIndex];
    auto cmd = sdCardCmdPins[controllerIndex];

    if (!LPC17_Gpio_OpenPin(d0.number)
        || !LPC17_Gpio_OpenPin(d1.number)
        || !LPC17_Gpio_OpenPin(d2.number)
        || !LPC17_Gpio_OpenPin(d3.number)
        || !LPC17_Gpio_OpenPin(clk.number)
        || !LPC17_Gpio_OpenPin(cmd.number)
        )
        return TinyCLR_Result::SharingViolation;

    LPC17_Gpio_ConfigurePin(d0.number, LPC17_Gpio_Direction::Input, d0.pinFunction, LPC17_Gpio_ResistorMode::PullUp, LPC17_Gpio_Hysteresis::Disable, LPC17_Gpio_InputPolarity::NotInverted, LPC17_Gpio_SlewRate::StandardMode, LPC17_Gpio_OutputType::PushPull);
    LPC17_Gpio_ConfigurePin(d1.number, LPC17_Gpio_Direction::Input, d1.pinFunction, LPC17_Gpio_ResistorMode::PullUp, LPC17_Gpio_Hysteresis::Disable, LPC17_Gpio_InputPolarity::NotInverted, LPC17_Gpio_SlewRate::StandardMode, LPC17_Gpio_OutputType::PushPull);
    LPC17_Gpio_ConfigurePin(d2.number, LPC17_Gpio_Direction::Input, d2.pinFunction, LPC17_Gpio_ResistorMode::PullUp, LPC17_Gpio_Hysteresis::Disable, LPC17_Gpio_InputPolarity::NotInverted, LPC17_Gpio_SlewRate::StandardMode, LPC17_Gpio_OutputType::PushPull);
    LPC17_Gpio_ConfigurePin(d3.number, LPC17_Gpio_Direction::Input, d3.pinFunction, LPC17_Gpio_ResistorMode::PullUp, LPC17_Gpio_Hysteresis::Disable, LPC17_Gpio_InputPolarity::NotInverted, LPC17_Gpio_SlewRate::StandardMode, LPC17_Gpio_OutputType::PushPull);
    LPC17_Gpio_ConfigurePin(clk.number, LPC17_Gpio_Direction::Input, clk.pinFunction, LPC17_Gpio_ResistorMode::Inactive, LPC17_Gpio_Hysteresis::Disable, LPC17_Gpio_InputPolarity::NotInverted, LPC17_Gpio_SlewRate::StandardMode, LPC17_Gpio_OutputType::PushPull);
    LPC17_Gpio_ConfigurePin(cmd.number, LPC17_Gpio_Direction::Input, cmd.pinFunction, LPC17_Gpio_ResistorMode::PullUp, LPC17_Gpio_Hysteresis::Disable, LPC17_Gpio_InputPolarity::NotInverted, LPC17_Gpio_SlewRate::StandardMode, LPC17_Gpio_OutputType::PushPull);

    auto memoryProvider = (const TinyCLR_Memory_Manager*)apiManager->FindDefault(apiManager, TinyCLR_Api_Type::MemoryManager);

    state->regionAddresses = (uint64_t*)memoryProvider->Allocate(memoryProvider, sizeof(uint64_t));
    state->regionSizes = (size_t*)memoryProvider->Allocate(memoryProvider, sizeof(size_t));


    state->descriptor.CanReadDirect = true;
    state->descriptor.CanWriteDirect = true;
    state->descriptor.CanExecuteDirect = false;
    state->descriptor.EraseBeforeWrite = false;
    state->descriptor.Removable = true;
    state->descriptor.RegionsRepeat = true;

