ghi-electronics/TinyCLR-Ports/Targets/LPC177x_LPC178x/LPC17_SD.cpp
    state->descriptor.RegionAddresses = reinterpret_cast<const uint64_t*>(state->regionAddresses);
    state->descriptor.RegionSizes = reinterpret_cast<const size_t*>(state->regionSizes);

    if (!MCI_And_Card_initialize())
        return TinyCLR_Result::InvalidOperation;

    state->isOpened = true;

    return TinyCLR_Result::Success;
}

TinyCLR_Result LPC17_SdCard_Release(const TinyCLR_Storage_Controller* self) {
    auto state = reinterpret_cast<SdCardState*>(self->ApiInfo->State);

    auto controllerIndex = state->controllerIndex;

    auto d0 = sdCardData0Pins[controllerIndex];
    auto d1 = sdCardData1Pins[controllerIndex];
    auto d2 = sdCardData2Pins[controllerIndex];
    auto d3 = sdCardData3Pins[controllerIndex];
    auto clk = sdCardClkPins[controllerIndex];
    auto cmd = sdCardCmdPins[controllerIndex];

    LPC_SC->PCONP &= ~(1 << 28); /* Disable clock to the Mci block */

    LPC_SC->PCONP &= ~(1 << 29); /* Disable clock to the Dma block */

    LPC17_Interrupt_Deactivate(DMA_IRQn); /* Disable Interrupt */

    if (state->isOpened) {
        auto memoryProvider = (const TinyCLR_Memory_Manager*)apiManager->FindDefault(apiManager, TinyCLR_Api_Type::MemoryManager);

        memoryProvider->Free(memoryProvider, state->regionSizes);
        memoryProvider->Free(memoryProvider, state->regionAddresses);
    }

    state->descriptor.RegionAddresses = nullptr;
    state->descriptor.RegionSizes = nullptr;
    LPC17_Gpio_ClosePin(d0.number);
    LPC17_Gpio_ClosePin(d1.number);
    LPC17_Gpio_ClosePin(d2.number);
    LPC17_Gpio_ClosePin(d3.number);
    LPC17_Gpio_ClosePin(clk.number);
    LPC17_Gpio_ClosePin(cmd.number);

    state->isOpened = false;

    return TinyCLR_Result::Success;
}

TinyCLR_Result LPC17_SdCard_Write(const TinyCLR_Storage_Controller* self, uint64_t address, size_t& count, const uint8_t* data, uint64_t timeout) {
    int32_t index = 0;

    int32_t to = timeout;

    auto sectorCount = count;

    auto sectorNum = address;

    uint8_t* pData = (uint8_t*)data;

    while (sectorCount) {
        if (MCI_WriteSector(sectorNum, &pData[index]) == true) {
            index += LPC17_SD_SECTOR_SIZE;
            sectorNum++;
            sectorCount--;
        }
        else {
            return TinyCLR_Result::InvalidOperation;
        }
    }

    if (!to) {
        return TinyCLR_Result::TimedOut;
    }

    return TinyCLR_Result::Success;

}

TinyCLR_Result LPC17_SdCard_Read(const TinyCLR_Storage_Controller* self, uint64_t address, size_t& count, uint8_t* data, uint64_t timeout) {
    int32_t index = 0;

    int32_t to = timeout;

    auto sectorCount = count;

    auto sectorNum = address;

    while (sectorCount) {
        if (MCI_ReadSector(sectorNum, &data[index]) == true) {
            index += LPC17_SD_SECTOR_SIZE;
            sectorNum++;
            sectorCount--;
        }
        else {
            return TinyCLR_Result::InvalidOperation;
        }
    }

    if (!to) {
        return TinyCLR_Result::TimedOut;
    }

    return TinyCLR_Result::Success;
}

TinyCLR_Result LPC17_SdCard_IsErased(const TinyCLR_Storage_Controller* self, uint64_t address, size_t& count, bool& erased) {
    erased = true;

    return TinyCLR_Result::Success;
}

TinyCLR_Result LPC17_SdCard_Erases(const TinyCLR_Storage_Controller* self, uint64_t address, size_t& count, uint64_t timeout) {
    return TinyCLR_Result::Success;
}

TinyCLR_Result LPC17_SdCard_GetDescriptor(const TinyCLR_Storage_Controller* self, const TinyCLR_Storage_Descriptor*& descriptor) {
    auto state = reinterpret_cast<SdCardState*>(self->ApiInfo->State);

    state->regionSizes[0] = LPC17_SD_SECTOR_SIZE;
    state->descriptor.RegionCount = sdMediaSize / LPC17_SD_SECTOR_SIZE;

    descriptor = reinterpret_cast<const TinyCLR_Storage_Descriptor*>(&state->descriptor);

    return TinyCLR_Result::Success;
}

TinyCLR_Result LPC17_SdCard_Open(const TinyCLR_Storage_Controller* self) {
    return TinyCLR_Result::Success;
}

TinyCLR_Result LPC17_SdCard_Close(const TinyCLR_Storage_Controller* self) {
    return TinyCLR_Result::Success;
}

TinyCLR_Result LPC17_SdCard_SetPresenceChangedHandler(const TinyCLR_Storage_Controller* self, TinyCLR_Storage_PresenceChangedHandler handler) {
    return TinyCLR_Result::Success;
}

TinyCLR_Result LPC17_SdCard_IsPresent(const TinyCLR_Storage_Controller* self, bool& present) {
    present = true;

    return TinyCLR_Result::Success;
}

TinyCLR_Result LPC17_SdCard_Reset() {
    return TinyCLR_Result::Success;
}
#endif // INCLUDE_SD